Series의 값처럼 축 이름 역시 유사한 방식으로 함수나 새롭게 바꿀 값으로 이용해서 변형할 수 있다.<br/>
새로운 자료 구조를 만들지 않고 그 자리에서 바로 축 이름을 변경하는 것이 가능하다.

In [1]:
import pandas as pd
import numpy as np

In [22]:
data = pd.DataFrame(np.arange(12).reshape(3,4),
                   index=['Ohio','Colorado','New York'],
                   columns=['one','two','three','four'])

In [23]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [24]:
data.index

Index(['Ohio', 'Colorado', 'New York'], dtype='object')

In [25]:
data.index.map(str.upper)

Index(['OHIO', 'COLORADO', 'NEW YORK'], dtype='object')

In [26]:
data.index = data.index.map(str.upper)

In [27]:
data

          one  two  three  four
OHIO        0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

원래 객체를 변경하지 않고 새로운 객체를 생성하려면 `rename` 메서드를 사용한다.

In [28]:
data.rename(index=str.title, columns=str.upper)

          ONE  TWO  THREE  FOUR
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

특히 `rename` 메서드는 사전 형식의 객체를 이용해서 축 이름 중 일부만 변경하는 것도 가능하다.

In [29]:
data.rename(index={'OHIO':'INDIANA'},
           columns={'three':'peekaboo'})

          one  two  peekaboo  four
INDIANA     0    1         2     3
COLORADO    4    5         6     7
NEW YORK    8    9        10    11

In [30]:
data

          one  two  three  four
OHIO        0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

`rename` 메서드를 사용하면 DataFrame을 직접 복사해서 index와 columns 속성을 갱신할 필요 없이 바로 변경할 수 있다.<br/>
원본 데이터를 바로 변경하려면 `inplace=True` 옵션을 넘겨주면 된다,.

In [36]:
data.rename(index={'OHIO':'INDIANA'}, inplace=True)

In [37]:
data

          one  two  three  four
INDIANA     0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11